Importing libraries

In [18]:
import os
import warnings

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

warnings.filterwarnings("ignore")

Checking the current working directory and list of files

In [19]:
os.getcwd() , os.listdir(os.getcwd())

('d:\\projects\\misc\\vacations_data_analysis',
 ['.git',
  '.gitignore',
  'data',
  'expenses_analysis.ipynb',
  'LICENSE',
  'README.md'])

reading the data file

In [20]:
data_file = "data/vacances.xlsx"

df = pd.read_excel(data_file,
                   header=0,
                   decimal=",")

df.head()

        date          description  amount category   payee
0 2024-08-02      misc. Decathlon    87.3     misc     NaN
1 2024-08-03  Grenoble to valence    22.6   travel     NaN
2        NaT      2theloo valence     2.0     misc  Bushra
3        NaT         Paul valence     4.3     food     NaN
4        NaT  valence to Narbonne   125.0   travel     NaN

padding the values in `date` column

In [21]:
df["date"] = df["date"].interpolate(method="pad")

df.head()

        date          description  amount category   payee
0 2024-08-02      misc. Decathlon    87.3     misc     NaN
1 2024-08-03  Grenoble to valence    22.6   travel     NaN
2 2024-08-03      2theloo valence     2.0     misc  Bushra
3 2024-08-03         Paul valence     4.3     food     NaN
4 2024-08-03  valence to Narbonne   125.0   travel     NaN

filling the missing values in `payee` column

In [22]:
df["payee"] = df["payee"].fillna("Salman")

df.head()

        date          description  amount category   payee
0 2024-08-02      misc. Decathlon    87.3     misc  Salman
1 2024-08-03  Grenoble to valence    22.6   travel  Salman
2 2024-08-03      2theloo valence     2.0     misc  Bushra
3 2024-08-03         Paul valence     4.3     food  Salman
4 2024-08-03  valence to Narbonne   125.0   travel  Salman